org/A_critical_history_of_renormalization_by_Kerson_Huang_in_2013.org
#+setupfile: ./hugo_setup.org
#+hugo_slug: A_critical_history_of_renormalization_by_Kerson_Huang_in_2013
#+TITLE: A critical history of renormalization by Kerson Huang in 2013
* Abstract
** Lorentz's theory of radiation damping
** perturbative QED
** Wilson's formulation
** Polchinski's functional equation
** Applications to "triviality" and dark energy
* 1. Dedication
** Wilson: the idea that scale determines the perception of the world seems obvious; what is nontrivial is to formulate this fact mathematically, as a physical theory
** The focus in this critique is on the applications of renormalization theory to particle physics as opposed to critical phenomena
* 2. Lorentz: Electron self-force and radiation damping
** What is the electron made of?
** Lorentz considered it as a uniform charge distribution of radius $$a$$ held together by as yet unknown forces
** Coulomb forces do not cancel out due to retardation giving rise to a "self-force" and Coulomb interactions give rise to a "self-mass"
** The self-mass diverges linearly when $$a \rightarrow 0$$ which was the first identification of the so-called "ultraviolet catastrophe"
* 3. The triumph of QED
* 4. Dyson: subtraction = multiplication, or the magic of perturbative renormalization
* 5. Gell-Mann and Low: It's all a matter of scale
* 6. Asymptotic freedom
* 7. The renormalization group (RG)
* 8. The Landau Ghost
* 9. Renormalizability
* 10. Wilson's renormalization theory
* 11. In the space of all possible Lagrangians
* 12. Polchinski's functional equation
* 13. Why triviality is not a problem
* 14. Asymptotic freedom and the Big Bang
