content/posts/A_critical_history_of_renormalization_by_Kerson_Huang_in_2013.md
+++
title = "A critical history of renormalization by Kerson Huang in 2013"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:33:38-04:00
slug = "A_critical_history_of_renormalization_by_Kerson_Huang_in_2013"
draft = false
+++

## Abstract {#abstract}


### Lorentz's theory of radiation damping {#lorentz-s-theory-of-radiation-damping}


### perturbative QED {#perturbative-qed}


### Wilson's formulation {#wilson-s-formulation}


### Polchinski's functional equation {#polchinski-s-functional-equation}


### Applications to "triviality" and dark energy {#applications-to-triviality-and-dark-energy}


## 1. Dedication {#1-dot-dedication}


### Wilson: the idea that scale determines the perception of the world seems obvious; what is nontrivial is to formulate this fact mathematically, as a physical theory {#wilson-the-idea-that-scale-determines-the-perception-of-the-world-seems-obvious-what-is-nontrivial-is-to-formulate-this-fact-mathematically-as-a-physical-theory}


### The focus in this critique is on the applications of renormalization theory to particle physics as opposed to critical phenomena {#the-focus-in-this-critique-is-on-the-applications-of-renormalization-theory-to-particle-physics-as-opposed-to-critical-phenomena}


## 2. Lorentz: Electron self-force and radiation damping {#2-dot-lorentz-electron-self-force-and-radiation-damping}


### What is the electron made of? {#what-is-the-electron-made-of}


### Lorentz considered it as a uniform charge distribution of radius \\[a\\] held together by as yet unknown forces {#lorentz-considered-it-as-a-uniform-charge-distribution-of-radius-a-held-together-by-as-yet-unknown-forces}


### Coulomb forces do not cancel out due to retardation giving rise to a "self-force" and Coulomb interactions give rise to a "self-mass" {#coulomb-forces-do-not-cancel-out-due-to-retardation-giving-rise-to-a-self-force-and-coulomb-interactions-give-rise-to-a-self-mass}


### The self-mass diverges linearly when \\[a \rightarrow 0\\] which was the first identification of the so-called "ultraviolet catastrophe" {#the-self-mass-diverges-linearly-when-a-rightarrow-0-which-was-the-first-identification-of-the-so-called-ultraviolet-catastrophe}


## 3. The triumph of QED {#3-dot-the-triumph-of-qed}


## 4. Dyson: subtraction = multiplication, or the magic of perturbative renormalization {#4-dot-dyson-subtraction-multiplication-or-the-magic-of-perturbative-renormalization}


## 5. Gell-Mann and Low: It's all a matter of scale {#5-dot-gell-mann-and-low-it-s-all-a-matter-of-scale}


## 6. Asymptotic freedom {#6-dot-asymptotic-freedom}


## 7. The renormalization group (RG) {#7-dot-the-renormalization-group--rg}


## 8. The Landau Ghost {#8-dot-the-landau-ghost}


## 9. Renormalizability {#9-dot-renormalizability}


## 10. Wilson's renormalization theory {#10-dot-wilson-s-renormalization-theory}


## 11. In the space of all possible Lagrangians {#11-dot-in-the-space-of-all-possible-lagrangians}


## 12. Polchinski's functional equation {#12-dot-polchinski-s-functional-equation}


## 13. Why triviality is not a problem {#13-dot-why-triviality-is-not-a-problem}


## 14. Asymptotic freedom and the Big Bang {#14-dot-asymptotic-freedom-and-the-big-bang}
